#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
// 操作符详解

// 算术操作符: + - * / %
// 移位操作符: << >>
// 位操作符:   & | ^
// 赋值操作符: =
// 单目操作符: !, -, +, &(取地址), sizeof, ~(按位取反), ++, --, *, (类型)
// 关系操作符: > >= < <= != ==
// 逻辑操作符: && || 
// 条件操作符: exp1?exp2:exp3
// 逗号表达式: exp1,exp2,...,expN  从左向右依次执行,整个表达式的结果是最后一个表达式的结果
// 下标引用:   []
// 函数调用:   ()
// 结构成员:   结构体变量.成员变量  结构体变量指针->成员变量

int main()
{
	// /,%
	int a1 = 5 / 2;
	double a11 = 5 / 2;
	double a12 = 5.0 / 2;
	int a2 = 5 % 2;//取模操作符左右操作数必须为整型(int);
	printf("%d %lf %lf %d\n", a1,a11,a12,a2);


	// >>:算术右移:右边丢弃,左边补原符号位
	//	  逻辑右移:右边丢弃,左边补0
	// <<:左移:左边丢弃,右边补0;
	// 不能移动负数位
	// 操作数必须为整数

	int a3 = -16;

	// 正整数的原码,反码,补码相同
	// 存储到内存的是补码,补码移位
	// a3的右移: 原码:10000000 00000000 00000000 00010000
	//			 反码:11111111 11111111 11111111 11101111	原码符号位不变,其他位取反
	//			 补码:11111111 11111111 11111111 11110000	反码+1=补码
	//	算术右移(补码):11111111 11111111 11111111 11111000
	//			 反码:11111111 11111111 11111111 11110111
	//			 原码:10000000 00000000 00000000 00001000

	printf("%d\n", a3 >> 1);

	// 位操作符 & | ^
	// 操作数必须是整数
	// 对补码进行位操作

	// & 按位与;| 按位或
	// ^ 按位异或(相同为0,相异为1)
	int a4 = 3;  // 00000000 00000000 00000000 00000011
	int a5 = 5;  // 00000000 00000000 00000000 00000101

	int a451 = a4 & a5;
	int a452 = a4 | a5;
	int a453 = a4 ^ a5;
	printf("%d %d %d\n", a451, a452, a453);

	// 不创建临时变量,实现两个变量的交换
	
	// 加减法 (可能会溢出)
	printf("a4=%d a5=%d\n", a4, a5);
	a4 = a4 + a5;
	a5 = a4 - a5;
	a4 = a4 - a5;
	printf("a4=%d a5=%d\n", a4, a5);

	// 异或法
	a4 = a4 ^ a5;
	a5 = a4 ^ a5;
	a4 = a4 ^ a5;
	printf("a4=%d a5=%d\n", a4, a5);


	// 求一个整数在内存中存储的二进制中1的个数

	int a6;
	int count = 0;
	scanf("%d", &a6);

	//统计a6的补码中1的个数

	/*while (a6 != 0)
	{
		if (a6 % 2 == 1)
		{
			count++;
		}
		a6 = a6 / 2;
	}*/

	int i1 = 0;
	for ( i1 = 0; i1 < 32; i1++)
	{
		if ((a6 & 1) == 1)  //按位与
		{
			count++;
		}
		a6 = a6 >> 1;  //移位操作符
	}

	printf("%d\n", count);

	// 赋值操作符
	// 复合赋值符 +=, -=, *=, /=, %=, >>=, <<=, &=, |=, ^=

	// 单目操作符 !, -, +, &(取地址), sizeof, ~(按位取反), ++, --, *, (类型)

	printf("%d\n", !a5);
	if (a5)
	{
		printf("呵呵\n");
	}
	if (!a5)
	{
		printf("哈哈\n");
	}

	int* ad1 = &a5;
	*ad1 = 20;

	char c1 = 'c';
	char* ad2 = &c1;
	int arr1[10] = { 0 };
	// sizeof 计算变量所占内存空间的大小,单位字节
	printf("%d\n", sizeof(a5));
	printf("%d\n", sizeof(int));

	printf("%d\n", sizeof(c1));
	printf("%d\n", sizeof(char));

	printf("%d\n", sizeof(ad1));
	printf("%d\n", sizeof(int*));

	printf("%d\n", sizeof(ad2));
	printf("%d\n", sizeof(char*));

	printf("%d\n", sizeof(arr1));
	printf("%d\n", sizeof(int[10])); //去掉数组名为数组的类型

	short s1 = 0;
	int a7 = 11;
	int a8 = -11;

	printf("%d\n", sizeof(s1 = a7 + 5)); //表达式值的类型取决于s1,sizeof内部的表达式不参与运算
	printf("%d\n", s1);

	printf("%d\n", ~a7);
	printf("%d\n", ~a8);

	a7 = a7 | (1 << 2);
	printf("%d\n",a7); //将a7的第三个二进制位改成1
	
	a7 = a7 & (~(1 << 2));
	printf("%d\n", a7); //将a7的第三个二进制位改成0

	int a9 = (int)3.54;
	printf("%d\n", a9);

	// 创建一个结构体类型-struct Stu
	struct Stu
	{
		//成员变量
		char name[20];
		int age;
		char id[20];
	};
	// 使用struct Stu类型创建了一个学生对象s1(结构体变量),并初始化
	struct Stu s2 = { "nbj",24,"20211014" };
	printf("%s\n", s2.name);
	printf("%d\n", s2.age);
	printf("%s\n", s2.id);

	struct Stu* addre1 = &s2;
	printf("%s\n", (*addre1).name);
	printf("%s\n", addre1->name);

	// 表达式求值

	// 隐式类型转换

	char c11 = 3;
	// 00000000 00000000 00000000 00000011
	// 00000011 (截断)
	char c12 = 127;
	// 00000000 00000000 00000000 01111111
	// 01111111 (截断)

	char c13 = c11 + c12;
	// 整型提升(补变量的数据类型的符号位)
	// 00000000 00000000 00000000 00000011
	// 00000000 00000000 00000000 01111111
	// 00000000 00000000 00000000 10000010
	// 10000010
	// 11111111 11111111 11111111 10000010
	// 11111111 11111111 11111111 10000001 (反码)
	// 10000000 00000000 00000000 01111110 (-126)
	printf("%d\n", c13);

	char c14 = 0xb6; // 10110110
	short c15 = 0x600;
	int c16 = 0xb6000000;

	if (c14 == 0xb6) 
	{
		printf("c14\n");
	}
	if (c15 == 0xb600)
	{
		printf("c15\n");
	}
	if (c16 == 0xb6000000)
	{
		printf("c16\n");
	}

	char c17 = 1;
	printf("%d\n", !c17);
	printf("%u\n", sizeof(c17));
	printf("%u\n", sizeof(+c17));
	printf("%u\n", sizeof(!c17));

	//算术转换

	// long double
	// double
	// float
	// unsigned long int 
	// long int 
	// unsigned int
	// int

	// 操作符的属性
	// 1. 操作符的优先级
	// 2. 操作符的结合性
	// 3. 是否控制求值顺序( && || ?():() )

	return 0;
}